Repository: DenisDarahan/EthereumBot
Catalog: locales/*/LC_MESSAGES/ethereumbot.po
Languages: ru

# withdraw_message
source: <a href="https://etherscan.io/address/{}">{}</a> <a href="https://etherscan.io/tx/{}">➖{}ETH</a> <b>To</b> <code>{}</code>
ru: <a href="https://etherscan.io/address/{}">{}</a> <a href="https://etherscan.io/tx/{}">➖{}ETH</a> <b>Получатель</b> <code>{}</code>

# replenishment_message
source: <a href="https://etherscan.io/address/{}">{}</a> <a href="https://etherscan.io/tx/{}">➕{}ETH</a> <b>From</b> <code>{}</code>
ru: <a href="https://etherscan.io/address/{}">{}</a> <a href="https://etherscan.io/tx/{}">➕{}ETH</a> <b>Отправитель</b> <code>{}</code>

# start_message
source: 🤖 Hello! It's <b>ETHTransesBot</b> I can help you manage your Ethereum wallet fast and without any difficulties To get started just add the wallet you need to manage and expect notifications of new transactions!
ru: 🤖Привет! Это <b>ETHTransesBot</b> Я помогу Вам быстро и удобно получать информацию о кошельках криптовалюты Ethereum Чтобы начать работу просто добавьте нужный кошелек и ожидайте уведомления о новых транзакциях!

# add_wallet_button
source: ➕ Add Wallet
ru: ➕ Добавить кошелек

# ask_get_wallet_number
source: Please, send me the wallet's number
ru: Отправьте, пожалуйста, номер кошелька

# cancel_button
source: ✖️ Cancel
ru: ✖️ Отменить

# cancel_get_wallet
source: Cancel adding new wallet...
ru: Отмена добавления кошелька...

# ask_get_wallet_name
source: You can specify a name for this wallet if you want
ru: Для удобства Вы можете указать имя для этого кошелька

# wallet_number_not_valid_error
source: Error! The entered number is not an Ethereum wallet
ru: Ошибка! Введенный номер не является кошельком Ethereum

# skip_button
source: Skip ⏩
ru: Пропустить ⏩

# success_register_wallet
source: Wallet added!
ru: Кошелек добавлен!

# wallet_number_not_found_error
source: Error! The wallet's number not found
ru: Ошибка! Номер кошелька не найден

# manage_wallets_button
source: 🗂 My Wallets
ru: 🗂 Мои кошельки

# absent_wallets_error
source: You still have not got registered any wallets
ru: У Вас ещё нет добавленных кошельков

# manage_wallets
source: Your wallets:
ru: Кошельки, за которыми Вы следите:

# ask_user_wait_for_wallet_info
source: The data is loading. Please wait
ru: Данные загружаются. Пожалуйста, подождите

# get_user_wallet
source: <a href="https://etherscan.io/address/{wallet}">{name}</a> <code>{wallet}</code> <b>Balance</b>: {balance} <code>ETH</code>
ru: <a href="https://etherscan.io/address/{wallet}">{name}</a> <code>{wallet}</code> <b>Баланс</b>: {balance} <code>ETH</code>

# wallet_not_found_error
source: Error! Wallet not found
ru: Ошибка! Кошелек не найден

# ask_delete_wallet
source: Accept wallet removal
ru: Подтвердите удаление кошелька

# success_wallet_delete
source: Wallet deleted!
ru: Кошелек удален!

# cancel_wallet_delete
source: Wallet removal canceled
ru: Удаление кошелька отменено

# ask_wait_history
source: The history is loading. Please, wait
ru: История загружается. Пожалуйста, ожидайте

# get_transactions_history
source: <a href="https://etherscan.io/address/{wallet}">{name}</a> <code>{wallet}</code> <b>{tr_type} transactions</b>{trs}
ru: <a href="https://etherscan.io/address/{wallet}">{name}</a> <code>{wallet}</code> <b>{tr_type} транзакции</b>{trs}

# get_norm_trs_button
source: Normal
ru: Обычные

# get_in_trs_button
source: Internal
ru: Внутренние

# transactions_data_not_found_error
source: Error! Data seems to be lost
ru: Ошибка! Веротно, данные утеряны

# wallet_notifications
source: <a href="https://etherscan.io/address/{wallet}">{name}</a> <code>{wallet}</code> <b>Minimal amount for notification</b>{amount} <code>ETH</code> <b>Transaction types</b> {tr_type}
ru: <a href="https://etherscan.io/address/{wallet}">{name}</a> <code>{wallet}</code> <b>Минимальная сумма оповещения</b> {amount} <code>ETH</code> <b>Типы транзакций</b> {tr_type}

# tr_type_in
source: ➡️💰 Incomes
ru: ➡️💰 Входящие

# ask_get_min_amount
source: Send the lowest amount in ETH to send the notification
ru: Укажите минимальную сумму в ETH для получения уведомлений

# cancel_get_amount
source: Cancel set minimum amount
ru: Отмена добавления минимальной суммы

# wrong_amount_error
source: Amount should be higher than 0.0000000001 and lower than 9999999999.9999999999
ru: Сумма должна быть больше 0.0000000001 и меньше 9999999999.9999999999

# success_get_amount
source: Amount saved
ru: Минимальная сумма сохранена

# ask_get_tr_type
source: Set transactions to display
ru: Укажите, какие транзакции отображать

# notifications_filters
source: ⚙️ Configure notifications
ru: ⚙️ Настроить уведомления

# wallet_history_button
source: 🗄 Transactions history
ru: 🗄 История переводов

# wallet_notifications_button
source: 🛎 Notifications
ru: 🛎 Уведомления

# delete_wallet_button
source: 🗑 Delete wallet
ru: 🗑 Удалить кошелек

# back_button
source: 🔙 Back
ru: 🔙 Назад

# history_filters_button
source: 🛠 Configure history
ru: 🛠 Настроить историю

# last_trs_button
source: 📒 100 transactions
ru: 📒 100 транзакций

# history_records_number_button
source: 🔖 Records number
ru: 🔖 Количество записей

# history_show_participant_button
source: 👤 Participant
ru: 👤 Участник

# done_button
source: ✅ Done
ru: ✅ Готово

# show_participant_button
source: 🙍‍♂️ Show participant
ru: 🙍‍♂️ Показывать участника

# not_show_participant_button
source: 🙅‍♂️ Don't show participant
ru: 🙅‍♂️ Не показывать участника

# off_notify_button
source: 📱 Turn off notifications
ru: 📱 Выключить уведомления

# on_notify_button
source: 📲 Turn on notifications
ru: 📲 Включить уведомления

# on_sound_button
source: 🔔 Turn on sound
ru: 🔔 Включить звук

# off_sound_button
source: 🔕 Turn off sound
ru: 🔕 Выключить звук

# change_nf_amount_button
source: 💵 Minimum amount
ru: 💵 Минимальная сумма

# change_nf_tr_type_button
source: 💰 Transaction types
ru: 💰 Типы транзакций

# tr_type_out
source: 💰➡️ Debits
ru: 💰➡️ Исходящие

# tr_type_inout
source: ➡️💰➡️ All
ru: ➡️💰➡️ Все

# accept_delete_button
source: ✅ Accept delete
ru: ✅ Подтвердить удаление

# decline_delete_button
source: ✖️ Cancel
ru: ✖️ Отменить
